#### Terraform Format and Style 🖌`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_organization_iam_custom_role.org_policy_compare_custom_role will be created
  + resource "google_organization_iam_custom_role" "org_policy_compare_custom_role" {
      + deleted     = (known after apply)
      + description = "IAM role for Cloud Function to Compare Org Policies"
      + id          = (known after apply)
      + name        = (known after apply)
      + org_id      = "948721840059"
      + permissions = [
          + "orgpolicy.policy.get",
          + "resourcemanager.projects.get",
          + "resourcemanager.projects.list",
          + "secretmanager.secrets.get",
          + "secretmanager.versions.access",
          + "secretmanager.versions.get",
          + "storage.objects.create",
          + "storage.objects.delete",
          + "storage.objects.get",
          + "storage.objects.list",
          + "storage.objects.update",
        ]
      + role_id     = "org_policy_compare_cfn-dev"
      + stage       = "GA"
      + title       = "Organization Policy Function Role"
    }

  # google_organization_iam_member.org_policy_compare_member will be created
  + resource "google_organization_iam_member" "org_policy_compare_member" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "948721840059"
      + role   = "organizations/948721840059/roles/org_policy_compare_cfn-dev"
    }

  # google_service_account.org_policy_compare_sa will be created
  + resource "google_service_account" "org_policy_compare_sa" {
      + account_id   = "org-policy-compare-dev"
      + display_name = "Organization Policy Compare"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.policy_bucket will be created
  + resource "google_storage_bucket" "policy_bucket" {
      + bucket_policy_only = true
      + force_destroy      = true
      + id                 = (known after apply)
      + location           = "US"
      + name               = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + storage_class      = "STANDARD"
      + url                = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # random_id.random will be created
  + resource "random_id" "random" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.pubsub_scheduled_example.google_cloud_scheduler_job.job[0] will be created
  + resource "google_cloud_scheduler_job" "job" {
      + description = "Starts Organization Policies check."
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "orgpolicy-notifier"
      + region      = "us-central1"
      + schedule    = "0 * * * *"
      + time_zone   = "America/Detroit"

      + pubsub_target {
          + data       = "U3RhcnRpbmcgQ29tcGFyaXNvbg=="
          + topic_name = "projects/orgpolicy-notifier/topics/orgpolicy-notifier-topic-dev"
        }
    }

  # module.pubsub_scheduled_example.module.main.data.archive_file.main will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "main"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./src.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = (known after apply)
      + type                = "zip"
    }

  # module.pubsub_scheduled_example.module.main.data.null_data_source.wait_for_files will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "wait_for_files"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "dependent_files_id" = (known after apply)
          + "source_dir"         = "./src"
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.pubsub_scheduled_example.module.main.google_cloudfunctions_function.main will be created
  + resource "google_cloudfunctions_function" "main" {
      + available_memory_mb           = 2048
      + description                   = "Compares Org Policies and alerts users."
      + entry_point                   = "announce_kickoff"
      + environment_variables         = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 0
      + name                          = (known after apply)
      + project                       = "orgpolicy-notifier"
      + region                        = "us-central1"
      + runtime                       = "python37"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = (known after apply)
      + source_archive_object         = (known after apply)
      + timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "google.pubsub.topic.publish"
          + resource   = "orgpolicy-notifier-topic-dev"

          + failure_policy {
              + retry = false
            }
        }
    }

  # module.pubsub_scheduled_example.module.main.google_storage_bucket.main will be created
  + resource "google_storage_bucket" "main" {
      + bucket_policy_only = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + location           = "US-CENTRAL1"
      + name               = (known after apply)
      + project            = "orgpolicy-notifier"
      + self_link          = (known after apply)
      + storage_class      = "REGIONAL"
      + url                = (known after apply)
    }

  # module.pubsub_scheduled_example.module.main.google_storage_bucket_object.main will be created
  + resource "google_storage_bucket_object" "main" {
      + bucket              = (known after apply)
      + content_disposition = "attachment"
      + content_encoding    = "gzip"
      + content_type        = "application/zip"
      + crc32c              = (known after apply)
      + detect_md5hash      = "different hash"
      + id                  = (known after apply)
      + md5hash             = (known after apply)
      + media_link          = (known after apply)
      + name                = (known after apply)
      + output_name         = (known after apply)
      + self_link           = (known after apply)
      + source              = "./src.zip"
      + storage_class       = (known after apply)
    }

  # module.pubsub_scheduled_example.module.main.null_resource.dependent_files will be created
  + resource "null_resource" "dependent_files" {
      + id       = (known after apply)
      + triggers = {}
    }

  # module.pubsub_scheduled_example.module.pubsub_topic.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "orgpolicy-notifier-topic-dev"
      + project = "orgpolicy-notifier"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @iloveicedgreentea, Action: `pull_request`, Working Directory: ``, Workflow: `Development environment checks and Terraform`*